function data=VL_diedai(i,u,n,Ve,VL,E,Ka,Lb,L)
data=zeros(5,n+1);%生成一个5行n+1列的0矩阵
data(:,1)=[E*(Ve-VL)*(1+u(i))*(L*(1+u(i))-2*(Ka(1)+Lb(1)))*((L*(1+u(i))-Ka(1)-3*Lb(1))*(L*(1+u(i))-3*Ka(1)-Lb(1))-12*Ka(1)*Lb(1))/(24*Ka(1)^4);
           E*(Ve-VL)*(1+u(i))*((L*(1+u(i))-Ka(1)-3*Lb(1))*(L*(1+u(i))-2*(Ka(1)+Lb(1)))-6*Ka(1)*Lb(1))/(-6*Ka(1)^3);
           E*(Ve-VL)*(1+u(i))*(L*(1+u(i))-Ka(1)-3*Lb(1))/(2*Ka(1)^2);
           E*(Ve-VL)*(1+u(i))/(-Ka(1));
           1];
%H_0
ta_1=[L*(u(i)+2)-4*Ka(1),Lb(1),                   0,                         0,                       0;
     4*Ka(1),            L*(u(i)+2)-3*Ka(1)-Lb(1),2*Lb(1),                   0,                       0; 
     0,                  3*Ka(1),                 L*(u(i)+2)-2*(Ka(1)+Lb(1)),3*Lb(1),                 0; 
     0,                  0,                       2*Ka(1),                   L*(u(i)+2)-Ka(1)-3*Lb(1),0; 
     0,                  0,                       0,                         Ka(1),                   E*(u(i)+2)*(Ve-VL)]; 
tc_1=[4*Ka(2),-Lb(2),         0,               0,              0;
     -4*Ka(2), 3*Ka(2)+Lb(2),-2*Lb(2),         0,              0; 
      0,      -3*Ka(2),       2*(Ka(2)+Lb(2)),-3*Lb(2),        0; 
      0,       0,            -2*Ka(2),        (Ka(2)+3*Lb(2)),-4*Lb(1); 
      0,       0,             0,              -Ka(2),          4*Lb(1)-E*(u(i)+2)];
%矩阵左除，x = A\B 是方程 Ax = B 的解。矩阵 A 和 B 必须拥有相同的行数。
data(:,2)=(ta_1)\(tc_1*data(:,1));
for t=2:n
    td=zeros(5,1);
    ta_t=[L*(u(i)+t+1)-4*Ka(1),Lb(1),                     0,                           0,                         0;
          4*Ka(1),             L*(u(i)+t+1)-3*Ka(1)-Lb(1),2*Lb(1),                     0,                         0; 
          0,                   3*Ka(1),                   L*(u(i)+t+1)-2*(Ka(1)+Lb(1)),3*Lb(1),                   0; 
          0,                   0,                         2*Ka(1),                     L*(u(i)+t+1)-Ka(1)-3*Lb(1),0; 
          0,                   0,                         0,                           Ka(1),                     E*(u(i)+1+t)*(Ve-VL)]; 
    tc_t=[4*Ka(2),-Lb(2),         0,               0,              0;
         -4*Ka(2), 3*Ka(2)+Lb(2),-2*Lb(2),         0,              0; 
          0,      -3*Ka(2),       2*(Ka(2)+Lb(2)),-3*Lb(2),        0; 
          0,       0,            -2*Ka(2),        (Ka(2)+3*Lb(2)),-4*Lb(1); 
          0,       0,             0,              -Ka(2),          4*Lb(1)-E*(u(i)+t+1)];
    for j=2:t
        tb_j=[4*Ka(j+1),-Lb(j+1),           0,                   0,                  0;
             -4*Ka(j+1), 3*Ka(j+1)+Lb(j+1),-2*Lb(j+1),           0,                  0; 
              0,        -3*Ka(j+1),         2*(Ka(j+1)+Lb(j+1)),-3*Lb(j+1),          0; 
              0,         0,                -2*Ka(j+1),          (Ka(j+1)+3*Lb(j+1)),-4*Lb(j); 
              0,         0,                 0,                  -Ka(j+1),            4*Lb(j)];
        td=td+tb_j*data(:,t-j+1);
    end
        data(:,j+1)=(ta_t)\(td+tc_t*data(:,j));
end
%data的第一列有问题